Revit 2027 API
ParameterTypeId.RebarSystemHookOrientBottomDirn1 Property
 "Bottom Major Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemHookOrientBottomDirn1 { get; }
Public Shared ReadOnly Property RebarSystemHookOrientBottomDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemHookOrientBottomDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemHookOrientBottomDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace